Revit 2027 API
ImageType.Unload Method
 Unload the linked image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Unload()
Public Sub Unload
public:
void Unload()
member Unload : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This ImageType is not a link.
ModificationForbiddenException |  The document containing this ImageType is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this ImageType is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document containing this ImageType has no open transaction.
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace